import pandas as pd

# Прочитати файл з оцінками
df = pd.read_csv('оцінки.csv')  # Замініть 'оцінки.csv' на шлях до вашого файлу

# Обчислити середнє значення оцінки по групі
середнє_значення_по_групі = df.groupby('група')['оцінка'].mean()

# Обчислити середнє значення оцінки для всіх студентів
середнє_значення_всіх_студентів = df['оцінка'].mean()

# Вивести середнє значення оцінки по групі
print("Середнє значення оцінки по групі:")
print(середнє_значення_по_групі)

print("середнє значення всіх студентів:")
print(середнє_значення_всіх_студентів)
            
# Вивести імена студентів, оцінка яких вище середньої
вище_середньої_оцінки = df[df['оцінка'] > середнє_значення_всіх_студентів]
print("\nІмена студентів з оцінкою вище середньої:")
print(вище_середньої_оцінки)
